app/views/customers/show.html.erb


    <% @customer.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]