app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]
SELECT SUM("orders"."subtotal_inc_tax") FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]
---
  def show
    @customer = Customer.includes(:orders).find(params[:id])
    @lifetime_value = @customer.orders.sum(:subtotal_inc_tax)